app/views/books/edit.html.erb

SELECT "categories".* FROM "categories"
---
    <%= simple_form_for @book, :html => { :multipart => true } do |f| %>
      <%= select_tag(:category_id, options_from_collection_for_select(Category.all, :id, :name), include_blank: "Select Category") %>