app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."book_id" = ? ORDER BY "reviews"."id" ASC LIMIT ?  [["user_id", 3], ["book_id", 7], ["LIMIT", 1]]
---
  def new
    if current_user
      @review = Review.where(user_id: current_user.id, book_id: params[:book_id]).first_or_initialize

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "Inspirational and intriguing book!"], ["created_at", "2017-10-11 10:03:38.804545"], ["updated_at", "2017-10-11 10:03:38.804545"], ["user_id", 1], ["book_id", 7]]
---
  def create
    @review = Review.new(review_params)
    @review.book_id = @book.id
    @review.user_id = current_user.id
    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", nil], ["updated_at", "2017-10-13 22:29:46.785030"], ["id", 7]]
---
  def update
    @review = Review.find(params[:id])
    if @review.update(review_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def find_book
      @book = Book.find(params[:book_id])